test_mix/cfdemSolverMixIB_test/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//===========================================================================//
// sub-models & settings

usedForSolverPiso false;

usedForSolverIB false;

useDynamicRefineMesh true;

modelType none; // A or B or Bfull or none

couplingInterval 10;

depth 0;

voidFractionModel mix;             // divided // centre // bigParticle

locateModel engineIB;              // standard

meshMotionModel noMeshMotion;

dataExchangeModel mixTwoWayMPI;    // M2M // twoWayMPI // mixTwoWayMPI

IOModel basicIO;                   // trackIO

probeModel off;

averagingModel mixDense;           // dense // dilute

clockModel off;                    // standardClock

smoothingModel off; // constDiffSmoothing

forceModels
(
    mixArchimedesIB
    mixShirgaonkarIB
);

momCoupleModels
(
    mixImplicitCouple
);

mixImplicitCoupleProps
{
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
}

//turbulenceModelType RASProperties;//LESProperties; //OFversion24x
turbulenceModelType turbulenceProperties; //OFversion30x

//===========================================================================//
// sub-model properties

ShirgaonkarIBProps
{
    velFieldName "U";
    pressureFieldName "p";
}

ArchimedesIBProps
{
    gravityFieldName "g";
    voidfractionFieldName "voidfractionNext";
}

mixArchimedesIBProps
{
    gravityFieldName "g";
    voidfractionFieldName "voidfractionNext";
    volumefractionFieldName "volumefractionNext";
}

mixShirgaonkarIBProps
{
    velFieldName "U";
    pressureFieldName "p";
}

twoWayFilesProps
{
    maxNumberOfParticles 10000;
    DEMts 0.00003;
}

"(mixTwoWayMPIProps|twoWayMPIProps)"
{
    maxNumberOfParticles 10100;
    liggghtsPath "../DEM/in.liggghts_run";
}

IBProps
{
    maxCellsPerParticle 1000;
    alphaMin 0.30;
    scaleUpVol 1.0;
}

mixProps
{
    alphaMin 0.3;
    scaleUpVol 1.0;
}

bigParticleProps
{
    maxCellsPerParticle 1000;
    alphaMin 0.30;
    scaleUpVol 1.0;
}

centreProps
{
    alphaMin 0.30;
}

dividedProps
{
    alphaMin 0.05;
    scaleUpVol 1.2;
}

engineIBProps
{
    treeSearch false;
    zSplit 8;
    xySplit 16;
}

// ************************************************************************* //
